app/controllers/responsables_controller.rb

  def index
    @responsable = Responsable.new
    @responsables = Responsable.all.order(:nombre)
---
SELECT "responsables".* FROM "responsables" ORDER BY "responsables"."nombre" ASC

  def create
    @responsable = Responsable.new(responsable_params)
    @responsable.nombre = params[:responsable][:nombre].upcase
    @responsable.materia = params[:responsable][:materia].upcase
    respond_to do |format|
      if @responsable.save
---
INSERT INTO "responsables" ("nombre", "docente", "materia", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "Diaz, Jorge"], ["docente", "t"], ["materia", "Computación"], ["created_at", "2019-01-27 19:09:09.872461"], ["updated_at", "2019-01-27 19:09:09.872461"]]

    def set_responsable
      @responsable = Responsable.find(params[:id])
---
SELECT  "responsables".* FROM "responsables" WHERE "responsables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]