app/controllers/turnos_controller.rb

  def index
    @turnos = Turno.all
---
SELECT "turnos".* FROM "turnos"