app/views/turnos/_form.html.erb

SELECT "responsables".* FROM "responsables"
---
    <%= form.label :responsable_id %>
      <%= collection_select(:responsable_id, :responsable_id, Responsable.all, :id, :nombre, {}, {:multiple => false})%>